Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.StructWallAnalyticalErrorAlign Property
 Can't align Analytical Model with joined Walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StructWallAnalyticalErrorAlign { get; }
Visual Basic
Public Shared ReadOnly Property StructWallAnalyticalErrorAlign As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StructWallAnalyticalErrorAlign {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace